In [3]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

In [35]:
df = pd.read_csv("hiring_ML3.csv")
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [36]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [37]:
# check for missing values
df.isnull(). values. any()

True

In [38]:
# see columns with null values
df.isnull().any()

experience                     True
test_score(out of 10)          True
interview_score(out of 10)    False
salary($)                     False
dtype: bool

In [39]:
df.isna().sum()  ## Returns the sum of NaN values in each column.

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [40]:
# fill exerience null values with zero
df.experience = df.experience.fillna("zero")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [41]:
# fill test score na with median
import math

median_score = math.floor(df["test_score(out of 10)"].median())
median_score

df["test_score(out of 10)"] = df["test_score(out of 10)"].fillna(median_score)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [42]:
# convert experience to numbers
df.experience = df.experience.apply(w2n.word_to_num)
df.experience

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [43]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

model training

In [49]:
# create model
reg = linear_model.LinearRegression()
reg.fit(df[["experience", "test_score(out of 10)", "interview_score(out of 10)"]], df["salary($)"])

LinearRegression()

In [51]:
# see coefficients and intercept
print("coefficients: ", reg.coef_)
print("intercept: ", reg.intercept_)

coefficients:  [2812.95487627 1845.70596798 2205.24017467]
intercept:  17737.26346433768

# predict salary
1. 2 yr experience, 9 test score, 6 interview score
2. 12 yr experience, 10 test score, 10 interview score

In [55]:
reg.predict([[2, 9, 6]]).item()

53205.96797671032

In [56]:
reg.predict([[12, 10, 10]]).item()

92002.18340611355